# 3x3 の 2 次元配列となる予定の配列
C = []

for _ in range(0, 3):
    # C の 1 行分を表す 1 次元配列
    row = list(map(int, input().split()))
    C.append(row)

# 矛盾していないかどうかを保持する変数
# 矛盾していたら False
ok = True

# C の 0 列目と 1 列目の差を調べ、全て同じ値でなければ矛盾
if C[0][0] - C[0][1] != C[1][0] - C[1][1] or C[1][0] - C[1][1] != C[2][0] - C[2][1]:
    ok = False

# C の 1 列目と 2 列目の差を調べ、全て同じ値でなければ矛盾
if C[0][1] - C[0][2] != C[1][1] - C[1][2] or C[1][1] - C[1][2] != C[2][1] - C[2][2]:
    ok = False

# C の 0 行目と 1 行目の差を調べ、全て同じ値でなければ矛盾
if C[0][0] - C[1][0] != C[0][1] - C[1][1] or C[0][1] - C[1][1] != C[0][2] - C[1][2]:
    ok = False

# C の 1 行目と 2 行目の差を調べ、全て同じ値でなければ矛盾
if C[1][0] - C[2][0] != C[1][1] - C[2][1] or C[1][1] - C[2][1] != C[1][2] - C[2][2]:
    ok = False

if ok:
    print("Yes")
else:
    print("No")
